const fields = [
  { key: 'state',       question: 'Какое было состояние собаки перед началом?' },
  { key: 'duration',    question: 'Сколько минут длилась тренировка?' },
  { 
    key: 'success', 
    question: 'Выбери цвет успеха тренировки:', 
    type: 'choice',
    options: [
      { label: '🟥 Красный', value: 'red' },
      { label: '🟨 Желтый', value: 'yellow' },
      { label: '🟩 Зеленый', value: 'green' },
    ]
  },
  { key: 'difficulties',question: 'С какими трудностями столкнулись?' },
  { key: 'triggers',    question: 'Были ли триггеры или фиксации?' },
  { key: 'comment',     question: 'Комментарий или наблюдения?' }
];

module.exports = {
  name: 'cu',
  sheetName: 'CU!A:Z',      // или 'CU!A1', главное — верный таб

  // порядок столбцов в таблице
  columns: [
    'timestamp',   // добавим автоматически
    'state',
    'duration',
    'success',
    'difficulties',
    'triggers',
    'comment'
  ],

  fields,                       // массив объектов
  questions: fields.map(f => f.question) // пригодится, если где-то нужно только тексты
};